Revit 2024 API
LightShape Properties
The LightShape type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LightShape Class
Autodesk.Revit.DB.Lighting Namespace